package com.ecmp.flow.util;

/**
 * *************************************************************************************************
 * <p/>
 * 实现功能：自定义异常
 * <p>
 * ------------------------------------------------------------------------------------------------
 * 版本          变更时间             变更人                     变更原因
 * ------------------------------------------------------------------------------------------------
 * 1.0.00      2017/11/29 10:47      谭军(tanjun)                    新建
 * <p/>
 * *************************************************************************************************
 */
public class FlowException extends  RuntimeException {
    public FlowException() {
        super();
    }
    public FlowException(String message) {
        super(message);
    }

    public FlowException(String message, Throwable cause) {
        super(message, cause);
    }
}
