package com.ecmp.flow.common.api;

import java.util.Map;

/**
 * *************************************************************************************************
 * <p/>
 * 实现功能： 流程条件API定义
 * <p>
 * ------------------------------------------------------------------------------------------------
 * 版本          变更时间             变更人                     变更原因
 * ------------------------------------------------------------------------------------------------
 * 1.0.00      2017/4/26 13:19      谭军(tanjun)                    新建
 * <p/>
 * *************************************************************************************************
 */
public interface IConditionServer {

    public Map<String,String> getPropertiesForConditionPojo(String conditonPojoName);

    public Object getConditonPojo(String id);

}
